eis-cart-tests-master@3bc714a7387/tests/test-data/intf-specs/gswf/template/EIS_ReutersDSSWrapper/request.xmlt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:even="http://www.thegoldensource.com/EventRaiserService.wsdl">
   <soapenv:Header/>
   <soapenv:Body>
      <even:RaiseEIS_ReutersDSSWrapperAsynchron>
         <even:FilterRequired>${FILTER_REQ!}</even:FilterRequired>
         <even:HistoryReasonType>${HST_REAS_TYP!}</even:HistoryReasonType>
         <even:MaxRequestsPerFile>500</even:MaxRequestsPerFile>
         <even:MaxRetryTime>5000</even:MaxRetryTime>
         <even:NoOfFilesToRunInParallel>2</even:NoOfFilesToRunInParallel>
         <even:PositionsSource>${POSITIONS_SOURCE!}</even:PositionsSource>
         <even:PricePointEventDefinitionId>${PRICE_POINT_DEF_ID!}</even:PricePointEventDefinitionId>
         <even:RTDownloadDirectory>${RT_DOWNLOAD_DIR!}</even:RTDownloadDirectory>
         <even:RTTimeout>100</even:RTTimeout>
         <even:RTUploadDirectory>${RT_UPLOAD_DIR!}</even:RTUploadDirectory>
         <even:RequestType>ReutersDSS_Terms_and_Conditions</even:RequestType>
         <even:RequestType>EIS_Reuters_Composite</even:RequestType>
         <even:RequestorID>UNKNOWN</even:RequestorID>
      </even:RaiseEIS_ReutersDSSWrapperAsynchron>
   </soapenv:Body>
</soapenv:Envelope>